
import type { Paper } from "../../types";

export const paper2024_p1: Paper = {
    id: "past-paper-2024-p1",
    title: "A/L ICT Paper I - 2024",
    examName: {
      sinhala: "අධ්‍යයන පොදු සහතික පත්‍ර (උසස් පෙළ) විභාගය",
      tamil: "கல்விப் பொதுத் தராதரப் பத்திர (உயர் தர)ப் பரீட்சை",
      english: "General Certificate of Education (Adv. Level) Examination",
    },
    year: 2024,
    subject: "තොරතුරු හා සන්නිවේදන තාක්ෂණය",
    subjectCode: 20,
    time: {
        sinhala: "පැය දෙකයි",
        tamil: "இரண்டு மணித்தியாலம்",
        english: "Two hours"
    },
    content: {
      title: "Paper I",
      instructions: "සියලුම ප්‍රශ්නවලට පිළිතුරු සපයන්න.\\n* පිළිතුරු පත්‍රයේ නියමිත ස්ථානයේ ඔබේ විභාග අංකය ලියන්න.\\n* පිළිතුරු පත්‍රයේ පිටුපස දී ඇති උපදෙස් ද සැලකිල්ලෙන් කියවා පිළිපදින්න.\\n* 1 සිට 50 තෙක් එක් එක් ප්‍රශ්නයට (1), (2), (3), (4), (5) යන පිළිතුරුවලින් නිවැරදි හෝ ඉතාමත් ගැළපෙන හෝ පිළිතුර තෝරාගෙන, එය, පිළිතුරු පත්‍රයේ පිටුපස දැක්වෙන උපදෙස් පරිදි කතිරයක් (X) යොදා දක්වන්න.\\n* ගණක යන්ත්‍ර භාවිතයට ඉඩ දෙනු නොලැබේ.",
      questions: [
        {
          id: "pq-2024-p1-1",
          questionNumber: 1,
          content: "<p>පහත දත්ත සලකන්න:</p><p>A – සංවේදකයකින් ලබාදෙන උෂ්ණත්ව අගයන්</p><p>B – පරිගණකයක සුරැකි ගොනුවක නිර්මාතෘගේ නම සහ එය නිර්මාණය කළ දිනය</p><p>C – සමාජ මාධ්‍ය ජාලයක බෙදාගැනෙන පළ කිරීම් (posts) සහ ප්‍රතිචාර (responses) එකතුවක්</p><p>ඉහත දත්තවල නිවැරදි වර්ගීකරණය පහත කවරක දැක්වේ ද?</p>",
          options: ["A – මහා දත්ත (big data), B - අඛණ්ඩ (continuous) දත්ත, C – දත්ත පිළිබඳ දත්ත (metadata)", "A − අඛණ්ඩ දත්ත, B – මහා දත්ත, C – දත්ත පිළිබඳ දත්ත", "A – අඛණ්ඩ දත්ත, B – දත්ත පිළිබඳ දත්ත, C – මහා දත්ත", "A – දත්ත පිළිබඳ දත්ත, B – මහා දත්ත, C – අඛණ්ඩ දත්ත", "A – දත්ත පිළිබඳ දත්ත, B – අඛණ්ඩ දත්ත, C – මහා දත්ත"],
          correctAnswer: 3,
          relatedNoteId: "note-1-1-6",
        },
        {
            id: "pq-2024-p1-2",
            questionNumber: 2,
            content: "<p>පහත කවරක් කාණ්ඩ සැකසුම (batch processing) සඳහා හොඳ උදාහරණ වේ ද?</p><p>A - දැනට හිස්, තමන්ට ආසන්නම රිය ගාල් කිරීමේ ස්ථානය, පරිශීලකයකුට ප්‍රතිදානය කරන පද්ධතියක්</p><p>B - පරිගණකයක ගොනු, සෑම දිනකම දවස අවසානයේදී, ස්වයංක්‍රීයව උපස්ථනය (backup) කරන පද්ධතියක්</p><p>C - දවසක් ඇතුළת ලද පාරිභෝගික ඇනවුම්, වටිනාකමේ අනුපිළිවෙළට සකසන පද්ධතියක්</p>",
            options: ["A පමණි", "A සහ B පමණි", "A සහ C පමණි", "B සහ C පමණි", "A, B සහ C යන සියල්ල ම"],
            correctAnswer: 4,
            relatedNoteId: "note-1-5-3-1"
        },
        {
          id: "pq-2024-p1-3",
          questionNumber: 3,
          content: "<p>පහත ඡේදයේ A සහ B හිස්තැන්වලට සුදුසු ආදේශක සහිත පිළිතුර තෝරන්න.</p><p>(A) ..................... ඉතා පැරණි වුවත්, එය තවමත් ලොව විශාලතම සංස්ථාවල දෛනික මෙහෙයුම්වල ප්‍රධාන කාර්යභාරයක් ඉටු කරයි. බලයට අමතරව, එහි ජනප්‍රියත්වයට හේතු වූ අනෙක් ප්‍රධාන කරුණ වන්නේ (B) ......................</p>",
          options: ["A – වළාකුළු පරිගණනය (cloud computing) B – එය අන්තර්ජාලය මත නොයැපීමයි.", "A – වළාකුළු පරිගණනය B – එය සේවාසපයන්නන් (service providers) මත නොයැපීමයි.", "A – මහා පරිගණකය (main frame computer) B – එහි අඩු මිලයි.", "A – මහා පරිගණකය B – එහි විශ්වාසනීයත්වයයි.", "A – මහා පරිගණකය B – අඩු විශාලත්වයයි."],
          correctAnswer: 4,
          relatedNoteId: "note-2-1-6"
        },
        {
            id: "pq-2024-p1-4",
            questionNumber: 4,
            content: "<p>විශේෂ උපකරණයක මූලික ආධාරයෙන් ඉදිකෙරුනු නිවාස ගම්මානයක් ඇමෙරිකා එක්සත් ජනපදයේ නිමවීමට ආසන්න ය. නිවාසවල බිත්ති මෙම උපකරණය භාවිතයෙන් ගොඩනගා ඇති අතර, අත්තිවාරම් සහ වහල සාම්ප්‍රදායික ක්‍රමයට ගොඩනගා ඇත. ඉදිකිරීම් ක්‍රියාවලියට අවශ්‍ය සේවකයන්ගේ ගණන මෙම උපකරණය අඩු කරන අතර ක්‍රියාවලිය ඉක්මන් සහ ලාභදායි කොට, ඉදිකිරීමකදී ඇතිවන නාස්තිය ද අවම කර ඇත. මෙම විශේෂ උපකරණය කුමක් විය හැකි ද?</p>",
            options: ["සංඛ්‍යාංකකයක් (digitizer)", "විශාල ත්‍රිමාණ මුද්‍රකයක් (3D printer)", "ලකුණු කරනයක් (plotter)", "දැක්වුම් උපාංගයක් (pointing device)", "මෙහෙයුම් යටියක් (joystick)"],
            correctAnswer: 2,
            relatedNoteId: "note-1-3-1"
        },
        {
          id: "pq-2024-p1-5",
          questionNumber: 5,
          content: "<p>පරිගණක මවු පුවරුවක ඇති සංරචක සහ සම්බන්ධතා සමහරක් පහත රූපයේ දක්වා ඇත.</p>[DIAGRAM:2024-p1-q5]<p>එහි ලේබල A-E මගින් පහත දෑ දැක්වේ.</p><p>A – දෘඪ ඩිස්කය<br/>B – ROM BIOS<br/>C – ශ්‍රව්‍ය කෙවෙනිය (audio port) සඳහා සම්බන්ධකය<br/>D – ජාල කෙවෙනිය (network port) සඳහා සම්බන්ධකය<br/>E – USB කෙවෙනිය සඳහා සම්බන්ධකය</p><p>X, Y සහ Z ලේබල මගින් පිළිවෙළින් දැක්වෙන්නේ මොනවා ද?</p>",
          options: ["X – වීඩියෝ කෙවෙනිය සඳහා සම්බන්ධකය, Y – CPU, Z – මතකය (memory)", "X – වීඩියෝ කෙවෙනිය සඳහා සම්බන්ධකය, Y – මතකය, Z – CPU", "X – CPU, Y – මතකය, Z – වීඩියෝ කෙවෙනිය සඳහා සම්බන්ධකය", "X – CPU, Y – වීඩියෝ කෙවෙනිය සඳහා සම්බන්ධකය, Z – මතකය", "X – මතකය, Y – වීඩියෝ කෙවෙනිය සඳහා සම්බන්ධකය, Z – CPU"],
          correctAnswer: 3,
          relatedNoteId: "note-2-2-0"
        },
        {
          id: "pq-2024-p1-6",
          questionNumber: 6,
          content: "<p>අලුත්වැඩියා කිරීමකින් පසුව මේස පරිගණකයක් දෘඪ ඩිස්කයෙන් ඉතා වේගයෙන් ආරම්භ (boot) වන බව පුද්ගලයෙක් නිරීක්ෂණය කරයි. අලුත්වැඩියාවේ දී පහත කවරක් සිදු කරන්නට ඇති ද?</p>",
          options: ["RAM අඩු කර මෙහෙයුම් පද්ධතිය නැවත ස්ථාපනය කිරීම", "දෘඪ ඩිස්කය ආකෘතිකරණය (format) කිරීම පමණක්", "අලුත් CD ධාවකයක් පිහිටුවීම (install) පමණක්", "පරිගණකය තුළ ඇති කුඩා පංකාව (fan) ආදේශ කිරීම පමණක්", "දෘඪ ඩිස්කය වෙනුවට ඝන තත්ත්ව ධාවකයක් (Solid State Drive) ආදේශ කර මෙහෙයුම් පද්ධතිය නැවත ස්ථාපනය කිරීම"],
          correctAnswer: 5,
          relatedNoteId: "note-3-1-3"
        },
        {
          id: "pq-2024-p1-7",
          questionNumber: 7,
          content: "<p>දශමය 14.25₁₀ ට තුල්‍ය වන නිවැරදි ද්විමය සංඛ්‍යාව කුමක් ද?</p>",
          options: ["1001.10₂", "1010.11₂", "1011.01₂", "1110.01₂", "1111.10₂"],
          correctAnswer: 4,
          relatedNoteId: "note-3-1-2"
        },
        {
          id: "pq-2024-p1-8",
          questionNumber: 8,
          content: "<p>අෂ්ඨමය 120₈ ට තුල්‍ය වන නිවැරදි දශමය සංඛ්‍යාව කුමක් ද?</p>",
          options: ["10", "17", "80", "136", "640"],
          correctAnswer: 3,
          relatedNoteId: "note-3-1-2"
        },
        {
          id: "pq-2024-p1-9",
          questionNumber: 9,
          content: "<p>පහත කවරක් නිවැරදි වේ ද?</p><p>I : EB7₁₆ = 1110 1011 0111₂</p><p>II : 84₁₀ = 1010100₂</p><p>III : 753₈ = 1001011₂</p>",
          options: ["I පමණි", "I සහ II පමණි", "I සහ III පමණි", "II සහ III පමණි", "I, II සහ III යන සියල්ල ම"],
          correctAnswer: 2,
          relatedNoteId: "note-3-1-2"
        },
        {
          id: "pq-2024-p1-10",
          questionNumber: 10,
          content: "<p>පහත වගුවේ දෙවැනි සහ තුන්වැනි පේළිවල ඉංග්‍රීසි වචන දෙකක් සහ ASCII කේතයට අනුව ඒවායේ ද්විමය නිරූපණයන් ඇත. No! හි ද්විමය නිරූපණය හිස්ව තබා ඇත.</p>[DIAGRAM:2024-p1-q10]<p>හිස්තැනට සුදුසු ආදේශකය කුමක් ද?</p>",
          options: ["0100001 1001110 1101111", "1001110 0100001 1101111", "1001110 1101111 0100001", "1101110 0100001 1101111", "1101110 1101111 0100001"],
          correctAnswer: 3,
          relatedNoteId: "note-5-3-1"
        },
        {
          id: "pq-2024-p1-11",
          questionNumber: 11,
          content: "<p>11001₂ + 10001₂ =</p>",
          options: ["101010₂", "101011₂", "101100₂", "111001₂", "111010₂"],
          correctAnswer: 1,
          relatedNoteId: "note-3-3-1"
        },
        {
          id: "pq-2024-p1-12",
          questionNumber: 12,
          content: "<p>දී ඇති පරිපථයේ ප්‍රතිදානය (F), පහත කවරකින් ප්‍රකාශ වේ ද?</p>[DIAGRAM:2024-p1-q12]",
          options: ["(X + Y)Z", "(X̅ + Y̅) + Z", "X(X + Y)Z", "X̅Y̅ + Z", "(X̅Y̅) + Z"],
          correctAnswer: 5,
          relatedNoteId: "note-4-1-0"
        },
        {
          id: "pq-2024-p1-13",
          questionNumber: 13,
          content: "<p>ද්විත්ව ප්‍රතිලෝම (Double complement) සහ ඩි මෝර්ගන්ගේ (De Morgan’s) න්‍යායයන් x + yz ට යෙදවූ විට පහත කවරක් ලැබේ ද?</p>",
          options: ["(x'+y')(x'+z')", "(x+y)(x+z)", "xyz", "x(yz)", "xy + yz"],
          correctAnswer: 2,
          relatedNoteId: "note-4-2-1"
        },
        {
          id: "pq-2024-p1-14",
          questionNumber: 14,
          content: "<p>දී ඇති කානෝ සිතියම හරහා ලබාගත හැකි සරලතම බූලීය ප්‍රකාශය කුමක් ද?</p>[DIAGRAM:2024-p1-q14]",
          options: ["y̅z", "xz", "x̅z", "z", "y + x̅z"],
          correctAnswer: 3,
          relatedNoteId: "note-4-2-4"
        },
        {
          id: "pq-2024-p1-15",
          questionNumber: 15,
          content: "<p>ක්‍රියායන පාලන ඛණ්ඩය (PCB) සම්බන්ධයෙන් පහත කවරක් නිවැරදි වේ ද?</p><p>A - එය ක්‍රියායනයක (process) තොරතුරු කළමනාකරණය කිරීම සඳහා මෙහෙයුම් පද්ධතිය විසින් භාවිත කරනු ලබන දත්ත ව්‍යුහයකි.</p><p>B - එය ක්‍රමලේඛයක් සම්පාදනයේ (compilation) දී සෑදේ.</p><p>C - PCB දෙකක Program Counter අගයන් එක සමාන විය හැකි ය.</p>",
          options: ["A පමණි", "A සහ B පමණි", "A සහ C පමණි", "B සහ C පමණි", "A, B සහ C යන සියල්ල ම"],
          correctAnswer: 3,
          relatedNoteId: "note-5-3-2"
        },
        {
          id: "pq-2024-p1-16",
          questionNumber: 16,
          content: "<p>අමර බහු-පරිශීලක පරිගණකයක් පණගන්වයි. එය ආරම්භ වූ විට සාමා එම පරිගණකයට ටර්මිනලයකින් පුරාන (login) වී වෙබ් අතරික්සුවක් අරඹයි. මද වේලාවකට පසුව සාමා තම පයිතන් කේතයේ වැඩකටයුතු කිරීම සඳහා පාඨ සංස්කාරකයක් ද (text editor) අරඹයි. ඉන්පසු රාණි ද මෙම පරිගණකයට වෙනත් ටර්මිනලයකින් පුරන වී වෙබ් අතරික්සුවක් අරඹයි. එම පරිගණකයේ සකසනය මත ධාවනය වන්නන්ගේ නිවැරදි අනුපිළිවෙළක් විය හැක්කේ පහත කවරක් ද?</p>",
          options: ["BIOS → OS → සාමාගේ වෙබ් අතරික්සු ක්‍රියායනය → OS → සාමාගේ පාඨ සංස්කාරක ක්‍රියායනය → OS → රාණිගේ වෙබ් අතරික්සු ක්‍රියායනය → OS → සාමාගේ පාඨ සංස්කාරක ක්‍රියායනය → ...", "BIOS → OS → සාමාගේ වෙබ් අතරික්සු ක්‍රියායනය → සාමාගේ පාඨ සංස්කාරක ක්‍රියායනය → OS → රාණිගේ වෙබ් අතරික්සු ක්‍රියායනය → OS → සාමාගේ වෙබ් අතරික්සු ක්‍රියායනය → ...", "BIOS → සාමාගේ වෙබ් අතරික්සු ක්‍රියායනය → සාමාගේ පාඨ සංස්කාරක ක්‍රියායනය → OS → රාණිගේ වෙබ් අතරික්සු ක්‍රියායනය → OS → සාමාගේ පාඨ සංස්කාරක ක්‍රියායනය → ...", "OS → BIOS → සාමාගේ වෙබ් අතරික්සු ක්‍රියායනය → OS → සාමාගේ පාඨ සංස්කාරක ක්‍රියායනය → OS → රාණිගේ වෙබ් අතරික්සු ක්‍රියායනය → OS → සාමාගේ වෙබ් අතරික්සු ක්‍රියායනය → ...", "OS → BIOS → සාමාගේ වෙබ් අතරික්සු ක්‍රියායනය → සාමාගේ පාඨ සංස්කාරක ක්‍රියායනය → OS → රාණිගේ වෙබ් අතරික්සු ක්‍රියායනය → OS → සාමාගේ වෙබ් අතරික්සු ක්‍රියායනය → ..."],
          correctAnswer: 1,
          relatedNoteId: "note-5-3-1"
        },
        {
          id: "pq-2024-p1-17",
          questionNumber: 17,
          content: "<p>ඩිස්කයක කට්ටියක් (block) බයිට 512 ක් වේ. බයිට 1959 ක විශාලත්වයකින් යුත් ගොනුවක් එම ඩිස්කයේ ආචය කළ විට, එම ගොනුවට වෙන් කරන ලද බයිට කොපමණ සංඛ්‍යාවක් අපතේ යනු ඇති ද?</p>",
          options: ["89", "423", "512", "601", "1447"],
          correctAnswer: 1,
          relatedNoteId: "note-5-2-1"
        },
        {
          id: "pq-2024-p1-18",
          questionNumber: 18,
          content: "<p>පහත රූප දෙක සම්බන්ධයෙන් දී ඇති කවර වගන්ති (I, II, III) නිවැරදි ද? (සැ.යු. V – වෝල්ටීයතාව t - කාලය)</p>[DIAGRAM:2024-p1-q18]<p>I – A ප්‍රතිසම (analog) සංඥාවක් නිරූපණය කරයි.</p><p>II – B අංකිත (digital) සංඥාවක් නිරූපණය කරයි.</p><p>III – B යනු A හි සංඛ්‍යාංකනය (digitize) කළ ස්වරූපයයි.</p>",
          options: ["I පමණි", "II පමණි", "III පමණි", "II සහ III පමණි", "I, II සහ III යන සියල්ල ම"],
          correctAnswer: 5,
          relatedNoteId: "note-6-3-0"
        },
        {
          id: "pq-2024-p1-19",
          questionNumber: 19,
          content: "<p>සමත්ව (parity) බිටු සම්බන්ධයෙන් පහත කවරක් නිවැරදි ද?</p>",
          options: ["බිටු සමූහයක සමත්ව බිටුව, එම බිටු සමූහය සන්නිවේදනයෙන් පසුව හරිගැස්සවෙයි.", "බිටු සමූහයක සමත්ව බිටුව තෝරාගැනෙනුයේ එම සමූහයේ මුළු 1-බිටු ගණන ඉරට්ටේ හෝ ඔත්තේ හෝ වන පරිදි ය.", "සන්නිවේදනයක සම්ප්‍රේෂණ වේගය සමත්ව බිටු මගින් වැඩි කෙරේ.", "වැරදි නිවැරදි කිරීමට, සන්නිවේදනයකින් පසුව සමත්ව බිටු එකතු කෙරේ.", "දත්ත සම්ප්‍රේෂණයකට අවශ්‍ය ගුප්ත කේතනය (encryption) සමත්ව බිටු මගින් සැපයේ."],
          correctAnswer: 2,
          relatedNoteId: "note-6-1-1"
        },
        {
          id: "pq-2024-p1-20",
          questionNumber: 20,
          content: "<p>පොදු ස්විච දුරකථන ජාල (PSTN) මඟකින් ප්‍රතිසම (analog) සංඥාවක් ලද විට මොඩමයකින් කුමක් සිදු වේ ද?</p>",
          options: ["වඩාත් පැහැදිලි ගුණය සඳහා එය සංඥාව විස්තාරණය (amplify) කරයි.", "ආචයනය (storage) සඳහා එය සංඥාව සම්පීඩනය (compress) කරයි.", "එය සංඥාව යළි අංකිත (digital) ස්වරූපයට විමූර්ඡනය (demodulate) කරයි.", "එය ආරක්ෂාව සඳහා සංඥාව ගුප්ත කේතනය (encrypt) කරයි.", "සම්ප්‍රේෂණය සඳහා එය සංඥාව තවදුරටත් මූර්ඡනය (modulate) කරයි."],
          correctAnswer: 3,
          relatedNoteId: "note-6-4-0"
        },
        {
            id: "pq-2024-p1-21",
            questionNumber: 21,
            content: "<p>ජාලයක ඇති ස්විචයක් වඩාත් හොඳින් විස්තර කරන්නේ පහත කුමන ප්‍රකාශයෙන් ද?</p>",
            options: ["වඩාත් පැහැදිලි සම්ප්‍රේෂණය සඳහා එය දත්ත සංඥා විස්තාරණය (amplify) කරයි.", "එය සැමවිටම පිටතින් එන සියලු දත්ත ජාලයේ ඇති සෑම උපාංගයකටම විකාශය (broadcast) කරයි.", "වඩාත් කාර්යක්ෂම සම්ප්‍රේෂණය සඳහා එය දත්ත සම්පීඩනය (compress) කරයි.", "දත්ත අපේක්ෂිත උපාංගයට පමණක් එය දත්ත යොමු කරයි.", "අනාගත සැකසුම් (processing) සඳහා එය දත්ත ආචය (store) කරයි."],
            correctAnswer: 4,
            relatedNoteId: "note-6-7-0"
        },
        {
            id: "pq-2024-p1-22",
            questionNumber: 22,
            content: "<p>192.168.100.0/27 IP යොමු කාණ්ඩයේ භාවිතයට ගත හැකි සත්කාරක යොමු කොපමණ පවතී ද?</p>",
            options: ["16", "30", "32", "62", "64"],
            correctAnswer: 2,
            relatedNoteId: "note-6-7-1"
        },
        {
            id: "pq-2024-p1-23",
            questionNumber: 23,
            content: "<p>සම්ප්‍රේෂණ පාලන නියමාවලියේ (TCP) ගුණාංග පහත ඒවායින් කවරක් ද?</p><p>A - සන්නිවේදනයක දෝෂ ඇත්නම් ඒවා හඳුනාගැනීම හා නිවැරදි කිරීම</p><p>B - දත්ත පැකට්ටුවක් ලැබුණු බව ලබන්නා (receiver) එවන්නාට (sender) දැන්වීම</p><p>C - දත්ත පැකට්ටු පිළිවෙළින් ලැබෙන බවට සහතික වීම</p>",
            options: ["A පමණි", "A සහ B පමණි", "A සහ C පමණි", "B සහ C පමණි", "A, B සහ C යන සියල්ල ම"],
            correctAnswer: 5,
            relatedNoteId: "note-6-8-0"
        },
        {
            id: "pq-2024-p1-24",
            questionNumber: 24,
            content: "<p>නව පද්ධතියක් නිශ්චිත දිනයක දී සේවාලාභියාට මුදා හැරිය යුතු ය. අර්ධ මුදා හැරීම් (partial deliveries) නොතිබිය යුතු ය. තවද කේතනය (coding) ඇරඹීමට පෙර, පද්ධති නිර්මිතය (system architecture) හා සැලසුම (design) සම්පූර්ණයෙන් නියම කර තිබිය යුතු ය. මෙම පද්ධතිය සංවර්ධනයට සුදුසු ආකෘති පහත ඒවායින් මොනවා ද?</p><p>A – දියඇලි (waterfall)</p><p>B – සර්පිල (spiral)</p><p>C – සුචල්‍ය (agile)</p>",
            options: ["A පමණි", "A සහ B පමණි", "A සහ C පමණි", "B සහ C පමණි", "A, B සහ C යන සියල්ල ම"],
            correctAnswer: 1,
            relatedNoteId: "note-7-3-0"
        },
        {
            id: "pq-2024-p1-25",
            questionNumber: 25,
            content: "<p>මෘදුකාංග සංවර්ධන ව්‍යාපෘතියක ශක්‍යතා විශ්ලේෂණයේදී හඳුනාගැනුනේ මෘදුකාංගය සංවර්ධනය කිරීමට සංවර්ධන කණ්ඩායමට දැනුම සහ කුසලතා නොමැති බව ය. ශක්‍යතා අධ්‍යයනයේ කුමන සංරචකය එම කරුණ හඳුනාගන්නට ඇති ද?</p>",
            options: ["ආර්ථික ශක්‍යතාව", "නීතිමය ශක්‍යතාව", "මෙහෙයුම් ශක්‍යතාව", "කාල (schedule) ශක්‍යතාව", "තාක්ෂණික ශක්‍යතාව"],
            correctAnswer: 5,
            relatedNoteId: "note-7-5-0"
        },
        {
          id: "pq-2024-p1-26",
          questionNumber: 26,
          content: "<p>පද්ධති සංවර්ධන ජීවන චක්‍රයේ (system development life cycle) අදියර නිවැරදිව පෙළඟස්වා ඇත්තේ පහත කවරක ද?</p>",
          options: ["ශක්‍යතා අධ්‍යයනය → අවශ්‍යතා විශ්ලේෂණය → පද්ධති නිර්මාණය → ක්‍රියාත්මක කිරීම → පරීක්ෂාව → යෙදවීම", "ශක්‍යතා අධ්‍යයනය → පද්ධති නිර්මාණය → අවශ්‍යතා විශ්ලේෂණය → ක්‍රියාත්මක කිරීම → පරීක්ෂාව → යෙදවීම", "අවශ්‍යතා විශ්ලේෂණය → ශක්‍යතා අධ්‍යයනය → පද්ධති නිර්මාණය → පරීක්ෂාව → යෙදවීම → ක්‍රියාත්මක කිරීම", "අවශ්‍යතා විශ්ලේෂණය → පද්ධති නිර්මාණය → ශක්‍යතා අධ්‍යයනය → යෙදවීම → පරීක්ෂාව → ක්‍රියාත්මක කිරීම", "පද්ධති නිර්මාණය → අවශ්‍යතා විශ්ලේෂණය → ශක්‍යතා අධ්‍යයනය → ක්‍රියාත්මක කිරීම → පරීක්ෂාව → යෙදවීම"],
          correctAnswer: 1,
          relatedNoteId: "note-7-4-0"
        },
        {
          id: "pq-2024-p1-27",
          questionNumber: 27,
          content: "<p>පද්ධති සංවර්ධනයේදී භාවිත වන මූලාකෘතිකරණය (prototyping) සම්බන්ධයෙන් පහත කවරක් අසත්‍ය ද?</p>",
          options: ["පද්ධති පරීක්ෂා (system testing) අදියරේදී මූලාකෘති, පරිශීලකයන්ගෙන් අනුමත විය යුතු ය.", "මූලාකෘතිකරණය සෑම ව්‍යාපෘතියකටම අවශ්‍ය හෝ සුදුසු හෝ නොවේ.", "සාර්ථක මූලාකෘතිකරණය පරිශීලක අවශ්‍යතා සහ බලාපොරොත්තු හොඳින් සපුරාලන පද්ධති සංවර්ධනය සඳහා ඉවහල් වේ.", "පද්ධතියකට වියදම් සහිත පසු වෙනස්කම් කිරීම තුරන් කිරීමට සාර්ථක මූලාකෘතිකරණය ඉවහල් වේ.", "මූලාකෘතිකරණයේ වාසි ලබාගැනීමට මූලාකෘති පිළිබඳ පරිශීලක ප්‍රතිචාර අතිශයින් වැදගත් වේ."],
          correctAnswer: 1,
          relatedNoteId: "note-7-3-0"
        },
        {
          id: "pq-2024-p1-28",
          questionNumber: 28,
          content: "<p>මෘදුකාංග පරීක්ෂා (software tests) සම්බන්ධයෙන් පහත කවර වගන්ති නිවැරදි වේ ද?</p><p>A - ශ්වේත මංජුසා (white-box) පරීක්ෂාවන්ට, මෘදුකාංගයක අභ්‍යන්තර ව්‍යුහයන් හා ක්‍රියාකිරීමේ විධි පිරික්සීම අයත් වේ.</p><p>B - සාමාන්‍යයෙන් පද්ධති (system) පරීක්ෂාවෙන් පසුව ඒකක (unit) පරීක්ෂාවන් සිදු කෙරේ.</p><p>C - ප්‍රතිග්‍රහණ පරීක්ෂාව (acceptance test) සාර්ථක කරගැනීමට පද්ධති සංවර්ධකයින් සෑම පරිශ්‍රමයක්ම දැරිය යුතු ය.</p>",
          options: ["A පමණි", "A සහ B පමණි", "A සහ C පමණි", "B සහ C පමණි", "A, B සහ C යන සියල්ල ම"],
          correctAnswer: 3,
          relatedNoteId: "note-7-8-0"
        },
        {
          id: "pq-2024-p1-29",
          questionNumber: 29,
          content: "<p>ප්‍රශ්න අංක 29 හා 30 සඳහා පිළිතුරු දීමට පහත විස්තරය කියවන්න.</p><p>සිසුන්ට හා අන් අයට කණ්ඩායම් ක්‍රීඩා සඳහා පාසල් ක්‍රීඩාපිටිය (පාසලට යාබදව ඇති) වෙන්කර ගැනීම සඳහා ක්‍රීඩාපිටිය වෙන් කරගැනීමේ පද්ධතියක් අවශ්‍ය ය. සෑම වෙන් කිරීමක්ම පැය දෙකක් සඳහා ය. සිසුන් නොවන සැම තම වෙන් කරගැනීම් සඳහා ගෙවීමක් කළ යුතු ය. වෙන් කරගැනීම් සිදු කරනුයේ ජාතික හැඳුනුම්පත් (NIC) අංක භාවිතයෙන් ය. ක්‍රීඩාපිටියේ ගේට්ටුවෙන් යම් කණ්ඩායමක් ඇතුල් කිරීමට පෙර NIC පත් පිරික්සීම සිදු වේ. වෙන් කරගැනීමේ ක්‍රියාවලිය සඳහා භාවිත කළ හැකි ඇල්ගොරිතමයක් A සිට D තෙක් හිස්තැන් ලේබල ද සහිතව පහත දැක්වේ.</p>[DIAGRAM:2024-p1-q29]<p>ඉහත හිස්තැන් සඳහා නිවැරදි ආදේශක දක්වන්නේ පහත කවරක් ද?</p>",
          options: ["A – දැනට ඇති වෙන් කිරීම් පෙන්වන්න B – දිනය වේලාව ලබාගන්න C - NIC අංකය ලබාගන්න D – පරිශීලකයාගේ හර ණය පත් ගෙවීම සම්පූර්ණ කරන්න", "A – දැනට ඇති වෙන් කිරීම් පෙන්වන්න B – දිනය වේලාව ලබාගන්න C - පරිශීලකයාගේ හර ණය පත් ගෙවීම සම්පූර්ණ කරන්න D – NIC අංකය ලබාගන්න", "A – දැනට ඇති වෙන් කිරීම් පෙන්වන්න B – NIC අංකය ලබාගන්න C - පරිශීලකයාගේ හර ණය පත් ගෙවීම සම්පූර්ණ කරන්න D – දිනය/වේලාව ලබාගන්න", "A – දිනය/වේලාව ලබාගන්න B – දැනට ඇති වෙන් කිරීම් පෙන්වන්න C – NIC අංකය ලබාගන්න D - පරිශීලකයාගේ හර/ණය පත් ගෙවීම සම්පූර්ණ කරන්න", "A – NIC අංකය ලබාගන්න B – දැනට ඇති වෙන් කිරීම් පෙන්වන්න C – දිනය වේලාව ලබාගන්න D – පරිශීලකයාගේ හර/ණය පත් ගෙවීම සම්පූර්ණ කරන්න"],
          correctAnswer: 1,
          relatedNoteId: "note-9-3-1"
        },
        {
          id: "pq-2024-p1-30",
          questionNumber: 30,
          content: "<p>ඉහත පද්ධතිය ගැන පහත කවර යෝජනාවක් නුසුදුසු වේ ද?</p>",
          options: ["අවශ්‍ය විටක, දී ඇති දිනයකට අදාළ වෙන්කිරීම්වල ලැයිස්තුවක් ලබා දිය යුතු ය.", "සිසුවකු වෙන් කිරීමක් සිදු කරන සෑම විටකම ඔහු/ඇය තම ගෙදර ලිපිනය ඇතුළත් කිරීම අවශ්‍ය කළ යුතු ය.", "NIC අංකයේ වලංගුතාවය පිරික්සීම සුදුසු වේ.", "වෙන්කිරීම් පාසල් වේලාවන් සමග ඝට්ටනය නොවිය යුතු ය.", "සාධාරණය සඳහා, යම් NIC අංකයකට දිනකට ඉඩ දෙන වෙන් කිරීම් ගණන සීමා කළ යුතු ය."],
          correctAnswer: 2,
          relatedNoteId: "note-7-6-0"
        },
        {
          id: "pq-2024-p1-31",
          questionNumber: 31,
          content: "<p>ආයතනයක වැඩසටහනකට ලියාපදිංචි වී ඇති සිසුවකුට අදාළ පහත සම්බන්ධය සලකන්න.</p><p>STUDENT(Sno, Snic, Sname, Sphone, Prog_number)</p><p>සටහන:<br/>Sno - සිසුවාගේ අනන්‍ය ලියාපදිංචි අංකය<br/>Snic - සිසුවාගේ ජාතික හැඳුනුම්පත් අංකය<br/>Sname - සිසුවාගේ නම<br/>Sphone - සිසුවාගේ දුරකථන අංකය<br/>Prog_number - සිසුවා ලියාපදිංචි වී ඇති වැඩසටහනේ අනන්‍ය අංකය</p><p>පහත කවරක් නිවැරදි ද?<br/>A - Sno ප්‍රාථමික (primary) යතුරක් විය හැකි ය.<br/>B - Snic නිරූප්‍ය (candidate) යතුරක් විය හැකි ය.<br/>C - Prog_number ආගන්තුක (foreign) යතුරක් විය හැකි ය.</p>",
          options: ["A පමණි", "A සහ B පමණි", "A සහ C පමණි", "B සහ C පමණි", "A, B සහ C යන සියල්ල ම"],
          correctAnswer: 5,
          relatedNoteId: "note-8-2-0"
        },
        {
          id: "pq-2024-p1-32",
          questionNumber: 32,
          content: "<p>පහත කවරක් නිවැරදි ද?</p><p>A - වගුවකට බොහෝ නිරූප්‍ය යතුරු (candidate keys) තිබිය හැකි ය.</p><p>B - ප්‍රාථමික යතුර (primary key) සැමවිටම නිරූප්‍ය යතුරකි.</p><p>C - එක් වගුවක නිරූප්‍ය යතුර, වෙනත් වගුවක ආගන්තුක යතුරක් (foreign key) ලෙස භාවිත කළ හැකි ය.</p>",
          options: ["A පමණි", "A සහ B පමණි", "A සහ C පමණි", "B සහ C පමණි", "A, B සහ C යන සියල්ල ම"],
          correctAnswer: 5,
          relatedNoteId: "note-8-2-0"
        },
        {
          id: "pq-2024-p1-33",
          questionNumber: 33,
          content: "<p>ඒක-බහු සම්බන්ධතාවලට පහත කවරක් උදාහරණ වේද?</p><p>A - පාරිභෝගිකයකුට ඇනවුම් කිහිපයක් කළ හැකි නමුත් එක ඇනවුමකට ඇත්තේ එක පාරිභෝගිකයකු පමණි.</p><p>B - එක් සේවකයකු ව්‍යාපෘති ගණනාවකට පත් කළ හැකි ය. එක් ව්‍යාපෘතියකට බොහෝ සේවකයන් සිටිය හැකි ය.</p><p>C - එක් දෙපාර්තමේන්තුවකට සිටින්නේ එක් කළමනාකරුවෙකි. සෑම කළමනාකරුවෙකුම බොහෝ දෙපාර්තමේන්තු කළමනාකරණය කරයි.</p><p>D - සැපයුම්කරුවකුට එක් අයිතමයක් පමණක් සැපයිය හැකි ය. එක් අයිතමයක් සැපයෙන්නේ එක් සැපයුම්කරුවකුගෙන් පමණි.</p>",
          options: ["A සහ B පමණි", "A සහ C පමණි", "A සහ D පමණි", "B සහ C පමණි", "C සහ D පමණි"],
          correctAnswer: 1,
          relatedNoteId: "note-8-2-0"
        },
        {
          id: "pq-2024-p1-34",
          questionNumber: 34,
          content: "<p>පහත 0 සිට 3 තෙක් ලේබල කර ඇති ප්‍රමත අවස්ථා A සිට D තෙක් ලේබල කර ඇති විස්තර සමග ගලපන්න.</p>[DIAGRAM:2024-p1-q34]",
          options: ["0-A, 1-B, 2-C, 3-D", "0-A, 1-C, 2-B, 3-D", "0-B, 1-C, 2-A, 3-D", "0-C, 1-A, 2-D, 3-B", "0-D, 1-B, 2-C, 3-A"],
          correctAnswer: 2,
          relatedNoteId: "note-8-7-0"
        },
        {
          id: "pq-2024-p1-35",
          questionNumber: 35,
          content: "<p>දත්ත සමුදා ප්‍රමතකරණයේ (normalization) මූලික අරමුණ කුමක් ද?</p>",
          options: ["දත්ත අනුපිටපත්වීම (redundancy) සහ නොගැලපීම් (anomalies) ඉවත් කිරීම", "දත්ත සමුදායේ වගු ගණන වැඩි කිරීම", "දත්ත තර්කානුකූල ව්‍යුහයන්ට හා සම්බන්ධතාවයන්ට පිළියෙළ කිරීම", "දත්ත සමුදා විමසුම් (queries) සරල කිරීම", "දත්ත සමුදා විමසුම් වේගවත් කිරීම"],
          correctAnswer: 1,
          relatedNoteId: "note-8-7-0"
        },
        {
          id: "pq-2024-p1-36",
          questionNumber: 36,
          content: "<p>පහත කවරක් මගින් USER සම්බන්ධයේ City උපලක්ෂණයේ ඇති සියලු Mahawa ලෙස ඇති තැන් Maho ලෙස වෙනස් කරයි ද?</p>",
          options: ["MODIFY USER SET City = 'Maho' WHERE City = 'Mahawa';", "MODIFY USER SET City = 'Mahawa' INTO City = 'Maho';", "UPDATE USER SET City = 'Mahawa' INTO City = 'Maho';", "UPDATE USER SET City = 'Maho' WHERE City = 'Mahawa';", "UPDATE USER SET City = 'Maho' WHERE City != 'Mahawa';"],
          correctAnswer: 4,
          relatedNoteId: "note-8-6-0"
        },
        {
          id: "pq-2024-p1-37",
          questionNumber: 37,
          content: "<p>දී ඇති SQL ප්‍රකාශ පද නිවැරදිව පෙළගස්වා ඇත්තේ පහත කවරක ද?</p>",
          options: ["SELECT, FROM, WHERE, GROUP BY, HAVING", "SELECT, GROUP BY, HAVING, FROM, WHERE", "SELECT, HAVING, FROM, WHERE, GROUP BY", "SELECT, WHERE, GROUP BY, HAVING, FROM", "SELECT, WHERE, HAVING, GROUP BY, FROM"],
          correctAnswer: 1,
          relatedNoteId: "note-8-6-0"
        },
        {
          id: "pq-2024-p1-38",
          questionNumber: 38,
          content: "<p>පහත පයිතන් කේතයේ a = 5, b = 3, c = 2 සහ d = 6 නම් එහි ක්‍රියාත්මක ප්‍රතිදානය කුමක් වේ ද?</p><pre><code>x = (a - b) ** c + d % c\\nprint(x)</code></pre>",
          options: ["-22", "0", "1", "4", "7"],
          correctAnswer: 4,
          relatedNoteId: "note-9-7-0"
        },
        {
          id: "pq-2024-p1-39",
          questionNumber: 39,
          content: "<p>පහත පයිතන් කේතයේ ක්‍රියාත්මක ප්‍රතිදානය කුමක් වේ ද?</p><pre><code>qns = [\"a\", \"b\"]\nfor x in range (1,3):\n  for y in qns:\n    print(x,y, end=' ')</code></pre>",
          options: ["0a2b", "1a3b", "1a1b2a2b", "1a1b3a3b", "1a3a1b3b"],
          correctAnswer: 3,
          relatedNoteId: "note-9-8-0"
        },
        {
          id: "pq-2024-p1-40",
          questionNumber: 40,
          content: "<p>පහත පයිතන් කේතයේ ක්‍රියාත්මක ප්‍රතිදානය කුමක් වේ ද?</p>[CODE:python]def list_operation(nlist):\n  for i in range(len(nlist)):\n    if i % 2 == 0:\n      nlist[i] = nlist[i] ** 2\n    else:\n      nlist[i] = nlist[i] + 3\n  return nlist\nnumbers = [1, 2, 3, 4, 5]\noutput = list_operation(numbers)\nprint(output)[/CODE]",
          options: ["[1, 5, 9, 7, 25]", "[1, 5, 9, 7, 5]", "[1, 2, 3, 4, 5]", "[1, 4, 9, 16, 25]", "[2, 5, 4, 7, 6]"],
          correctAnswer: 1,
          relatedNoteId: "note-9-9-0"
        },
        {
          id: "pq-2024-p1-41",
          questionNumber: 41,
          content: "<p>පහත පයිතන් කේතයේ ක්‍රියාත්මක ප්‍රතිදානය කුමක් වේ ද?</p>[CODE:python]marks = [(1, \"amara\", 96), (2, \"rajah\", 34),\n(3, \"rani\", 49), (4, \"fahim\", 68)]\ni = -1\nwhile i < (len(marks) - 1):\n  i += 1\n  if marks[i][2] < 50:\n    continue\n  print(marks[i][1], end=\" \")[/CODE]",
          options: ["14", "1 amara 4 fahim", "amara fahim", "rajah", "rajah rani"],
          correctAnswer: 3,
          relatedNoteId: "note-9-8-0"
        },
        {
          id: "pq-2024-p1-42",
          questionNumber: 42,
          content: "<p>රූපය 42.3 හි ඇති පයිතන් කේතයේ P – U ලේබලවලින් දැක්වෙන හිස්තැන් සඳහා සුදුසු ආදේශක යොදා එය ක්‍රියාත්මක කිරීමෙන්, රූපය 42.1 හි ඇති exports_imports.txt ගොනුව භාවිත කොට රූපය 42.2 න් දැක්වෙන ප්‍රතිදානය ලබාගත හැක.</p><p><b>රූපය 42.1: exports_imports.txt ගොනුව</b></p>[CODE:text]Garments E 45%\\nFuel I 20%\\nMachinery I 15%\\nTea E 20%\\nChemicals I 10%\\nRubber E 15%[/CODE]<p><b>රූපය 42.2: ප්‍රතිදානය</b></p>[CODE:text]Garments : 45%\\nTea : 20%\\nRubber : 15%[/CODE]<p><b>රූපය 42.3: පයිතන් කේතය</b></p>[CODE:python]P = open('exports_imports.txt','r')\\nwhile True:\\n  Q = P.readline()\\n  if not Q:\\n    R\\n  item = Q.split()\\n  if item[S] == \"E\":\\n    print(item[T],\":\",item[U])\\nP.close()[/CODE]<p>හිස්තැන් සඳහා සුදුසු ආදේශක දැක්වෙන වරණය කුමක් ද?</p>",
          options: ["P-file, Q-line, R-break, S-1, T-0, U-2", "P-file, Q-line, R-continue, S-2, T-1, U-3", "P-file, Q-line, R-continue, S-1, T-0, U-2", "P-line, Q-file, R-continue, S-1, T-0, U-2", "P-line, Q-file, R-break, S-1, T-0, U-2"],
          correctAnswer: 1,
          relatedNoteId: "note-9-11-0"
        },
        {
          id: "pq-2024-p1-43",
          questionNumber: 43,
          content: "<p>වෙබ් සම්පාදන මෙවලම් (web authoring tools) භාවිතයෙන් සෑදුන වෙබ් පිටු සම්බන්ධයෙන් පහත කවර වගන්ති නිවැරදි වේද?</p><p>A - එවැනි පිටුවක HTML කේතය ස්වයංක්‍රීයව සෑදේ.</p><p>B - පසුව HTML උසුලන අත්යුරුව එකතු කිරීමෙන් එවැනි පිටුවක් වැඩිදියුණු කළ හැකි ය.</p><p>C - බහුමාධ්‍ය (multimedia) අන්තර්ගත ඒවාට එකතු කළ නොහැක.</p>",
          options: ["A පමණි", "A සහ B පමණි", "A සහ C පමණි", "B සහ C පමණි", "A, B සහ C යන සියල්ල ම"],
          correctAnswer: 2,
          relatedNoteId: "note-10-3-0"
        },
        {
          id: "pq-2024-p1-44",
          questionNumber: 44,
          content: "<p>HTML විලාස පතක (style sheet) මූලික අරමුණ කුමක් ද?</p>",
          options: ["HTML මූලාංගවලට (elements) ආකෘතිකරණ (formatting) හා විලාස (style) යෙදවීමට", "වෙබ් අඩවියක් සඳහා දත්ත සමුදා සෑදීමට", "වෙබ් පිටුවක ව්‍යුහය නියම කිරීමට", "දත්ත සමුදා වෙත පෝරම දත්ත යැවීමට", "වෙබ් පිටුවක අන්තර්ගතය යාවත්කාලීන කිරීමට"],
          correctAnswer: 1,
          relatedNoteId: "note-10-5-0"
        },
        {
          id: "pq-2024-p1-45",
          questionNumber: 45,
          content: "<p>එක ගොනුවක් පමණක් වෙනස් කර, සම්පූර්ණ වෙබ් අඩවියකම පෙනුම වෙනස් කිරීමට පහත කවරක් භාවිත කළ හැකි ද?</p><p>A - බාහිර (external) CSS</p><p>B – පේළිගත (inline) CSS</p><p>C – අභ්‍යන්තරික (internal) CSS</p>",
          options: ["A පමණි", "A සහ B පමණි", "A සහ C පමණි", "B සහ C පමණි", "A, B සහ C යන සියල්ල ම"],
          correctAnswer: 1,
          relatedNoteId: "note-10-5-0"
        },
        {
          id: "pq-2024-p1-46",
          questionNumber: 46,
          content: "<p>HTML පෝරමයක POST භාවිත කිරීමේ අරමුණ කුමක් ද?</p>",
          options: ["පෝරමය ඉදිරිපත් (submit) කළ පසු තහවුරු කිරීමේ (confirmation) පණිවුඩයක් සංදර්ශනය කිරීමට", "පෝරමයේ දත්ත තිරයේ සංදර්ශනය කිරීමට", "වෙබ් පිටුව පුබුදු කිරීමට (refresh)", "සේවාදායකයෙන් (server) දත්ත ලබාගැනීමට", "පෝරමයේ දත්ත සේවාදායකයට යැවීමට"],
          correctAnswer: 5,
          relatedNoteId: "note-10-7-0"
        },
        {
          id: "pq-2024-p1-47",
          questionNumber: 47,
          content: "<p>වෙබ් අඩවියක් ප්‍රසිද්ධ කිරීම (publishing) සම්බන්ධයෙන් නිවැරදි පහත කවරක් ද?</p><p>A - වෙබ් අඩවියක් ප්‍රසිද්ධ කිරීමට යමෙකු වසම් නාමයක් (domain name) ලබාගත යුතු ය.</p><p>B - තමාගේම පරිගණකය වෙබ් අඩවි සත්කාරකය (host) ලෙස භාවිත කිරීමට තීරණය කිරීමට පෙර, යමෙකු ඒ පිළිබඳව හොඳ පිරිවැය-ප්‍රතිලාභ (cost-benefit) විශ්ලේෂණයක් කළ යුතු ය.</p><p>C - අතථ්‍ය පෞද්ගලික සේවාදායකයක (virtual private server) හෝ තමන්ටම වෙන් වූ සේවාදායකයක (dedicated server) හෝ ප්‍රසිද්ධ කිරීමට වඩා හවුලේ ප්‍රසිද්ධ කිරීම (shared hosting) සෑමවිටම වෙබ් අඩවියේ පරිශීලකයන්ට ඊට වේගවත් ප්‍රවේශවීම් ලබාදෙනු ඇත.</p>",
          options: ["A පමණි", "A සහ B පමණි", "A සහ C පමණි", "B සහ C පමණි", "A, B සහ C යන සියල්ල ම"],
          correctAnswer: 2,
          relatedNoteId: "note-10-7-0"
        },
        {
          id: "pq-2024-p1-48",
          questionNumber: 48,
          content: "<p>පහත කවරක් නිවැරදි වේද?</p>",
          options: ["ආඩුයිනෝ ඌනෝ (Arduino Uno) යනු සරල සාර්ව ද්‍රව්‍ය අන්තර්ජාල (IoT) යෙදුම් ඇටවීමට භාවිත කරන නියමාවලියයි (protocol).", "LDR හා LED යනු, ආඩුයිනෝ ඌනෝ මත පදනම් වූ IoT යෙදුම් සඳහා භාවිත වන සංවේදක (sensors) වේ.", "ආඩුයිනෝ ඌනෝ පුවරුවක් හා පරිගණකයක් අතර ශ්‍රේණිගත සන්නිවේදනයකට (serial communication) මුල පිරීමට Serial.begin(9600) වලංගු බෝඩ් ශීඝ්‍රතාවක් (baud rate) සපයයි.", "ආඩුයිනෝ ඌනෝට දෘඪ ඩිස්කයක් නැති නිසා එයට අනවසර දත්ත ප්‍රවේශයන් විඳීමට සිදු නොවේ.", "ATMega328P ක්ෂුද්‍ර පාලකයෙහි A0 – A5 අතර තුඩු හතරට ඊතර්නෙට් පළිහක් (ethernet shield) සම්බන්ධ කළ යුතුම ය."],
          correctAnswer: 3,
          relatedNoteId: "note-11-2-0"
        },
        {
          id: "pq-2024-p1-49",
          questionNumber: 49,
          content: "<p>පහත කවර වගන්ති සත්‍ය වේ ද?</p><p>A - ජනක කෘත්‍රිම බුද්ධි (generative AI) මෙවලම්වලට, ඔවුන් ඉගෙනගත් රටාවන්ට අනුව අලුත් අන්තර්ගත (content) හෝ දත්ත හෝ නිෂ්පාදනය කළ හැකි ය.</p><p>B - පරිශීලක ප්‍රේරක (user prompts) සහිත GPT වැනි ජනක කෘත්‍රිම බුද්ධි මෙවලම් භාවිතය යන්ත්‍ර-යන්ත්‍ර සහපැවැත්ම (coexistence) සඳහා උදාහරණයකි.</p><p>C - කෘත්‍රිම බුද්ධිය දැනට භාවිත වුවද, ප්‍රබල කෘත්‍රිම බුද්ධිය (strong AI) [මිනිස් සංජානනයට (cognition) සමාන සාමාන්‍ය බුද්ධිය හා හැකියාවන් සහිත යන්ත්‍ර] තවමත් න්‍යායාත්මක සංකල්පයක්ව පවතී.</p>",
          options: ["A පමණි", "A සහ B පමණි", "A සහ C පමණි", "B සහ C පමණි", "A, B සහ C යන සියල්ල ම"],
          correctAnswer: 3,
          relatedNoteId: "note-13-1-0"
        },
        {
          id: "pq-2024-p1-50",
          questionNumber: 50,
          content: "<p>පහත P හා Q වගන්ති සලකන්න:</p><p>P – ක්වොන්ටම් පරිගණකයක කියුබිටයක් (qubit), සාම්ප්‍රදායික පරිගණකයක බිටුවකට වඩා වැඩි තත්ව (states) දැරිය හැකි ය.</p><p>Q – දැනට සාම්ප්‍රදායික පරිගණකවලට ළඟා විය නොහැකි ගණනය කිරීම්, ඇදහිය නොහැකි වේගයකින් කිරීමට ක්වොන්ටම් පරිගණකය පෙරනිමිති පාදයි.</p><p>ඉහත වගන්ති දෙක සම්බන්ධයෙන් පහත කවරක් නිවැරදි වේද?</p>",
          options: ["P හා Q යන වගන්ති දෙකම නිවැරදි වන අතර, P වගන්තිය, Q වගන්තියට හේතුව දක්වයි.", "P හා Q යන වගන්ති දෙකම නිවැරදි වන නමුත්, එම වගන්ති දෙකෙන් ඉදිරිපත් කෙරෙන කරුණු අතර සම්බන්ධයක් නැත.", "P වගන්තිය නිවැරදි වන අතර Q වගන්තිය වැරදි වේ.", "P වගන්තිය වැරදි වන අතර Q වගන්තිය නිවැරදි වේ.", "P හා Q වගන්ති දෙකම වැරදි වේ."],
          correctAnswer: 1,
          relatedNoteId: "note-13-3-0"
        }
      ]
    }
  };
