

import type { Paper } from "../../types";

export const modelPaper1: Paper = {
    id: "model-paper-1",
    title: "ආදර්ශ ප්‍රශ්න පත්‍රය 1",
    examName: {
      sinhala: "ආදර්ශ ප්‍රශ්න පත්‍රය",
      tamil: "மாதிரி வினாத்தாள்",
      english: "Model Paper",
    },
    year: 2024,
    issuer: {
      sinhala: "All Bits of ICT",
      tamil: "All Bits of ICT",
      english: "All Bits of ICT",
    },
    subject: "තොරතුරු හා සන්නිවේදන තාක්ෂණය",
    subjectCode: 24,
    time: {
        sinhala: "පැය දෙකයි",
        tamil: "இரண்டு மணித்தியாலம்",
        english: "Two hours"
    },
    content: {
      title: "Unit 1: තොරතුරු හා සන්නිවේදන තාක්ෂණයේ මූලික සංකල්ප",
      partA: {
        title: "Part 1",
        instructions: "A - පහත ප්‍රශ්න සඳහා වඩාත් ගැලපෙන පිළිතුර තෝරන්න",
        questions: [
            {
                id: "mp1-1a-1",
                questionNumber: 1,
                content: "<p>“75, 80, 65” යනු ශිෂ්‍යයෙකුගේ විෂයයන් තුනක ලකුණු වේ. “ශිෂ්‍යයාගේ සාමාන්‍ය ලකුණු 73.3 කි” යන්න සලකන්න. මෙම ප්‍රකාශ දෙක නිවැරදිව ගැලපෙන්නේ කුමන පිළිතුරේද?</p>",
                options: [
                    "දත්ත, දත්ත",
                    "තොරතුරු, තොරතුරු",
                    "දත්ත, තොරතුරු",
                    "තොරතුරු, දත්ත",
                    "දැනුම, දත්ත"
                ],
                correctAnswer: 3,
                relatedNoteId: "note-1-1-1"
            },
            {
                id: "mp1-1a-2",
                questionNumber: 2,
                content: "<p>වටිනා තොරතුරුවල ලක්ෂණ නිවැරදිව දක්වා ඇත්තේ කුමන පිළිතුරේද?</p>",
                options: [
                    "අදාලත්වය, කාලීන බව, නිරවද්‍යතාව, පූර්ණත්වය, තේරුම් ගැනීමේ හැකියාව",
                    "අදාලත්වය, පවතින බව, කාලීන බව, පූර්ණත්වය, තේරුම් ගැනීමේ හැකියාව",
                    "අදාලත්වය, පූර්ණත්වය, පවතින බව, ප්‍රවේශ වීමේ හැකියාව, තේරුම් ගැනීමේ හැකියාව",
                    "අදාලත්වය, කාලීන බව, පවතින බව, නිරවද්‍යතාව, තේරුම් ගැනීමේ හැකියාව",
                    "අදාලත්වය, පවතින බව, නිරවද්‍යතාව, පූර්ණත්වය, තේරුම් ගැනීමේ හැකියාව"
                ],
                correctAnswer: 1,
                relatedNoteId: "note-1-1-5"
            },
            {
                id: "mp1-1a-3",
                questionNumber: 3,
                content: `<p>තොරතුරු සම්බන්ධයෙන් පහත ප්‍රකාශ සලකා බලන්න.</p>
                <p>A. තොරතුරුවල වටිනාකම එහි අදාලත්වය මත රඳා නොපවතී.</p>
                <p>B. තොරතුරක ඉහළම වටිනාකම ලෙස සලකනු ලබන්නේ එය නිර්මාණය කරන අවස්ථාව හෝ නිකුත් කරන අවස්ථාවයි.</p>
                <p>C. කාලයත් සමඟ තොරතුරුවල වටිනාකම ක්‍රමයෙන් අඩු වී, අඩු වටිනාකමක් ඇති වේ.</p>
                <p>ඉහත ප්‍රකාශ වලින් නිවැරදි වන්නේ කුමක්ද?</p>`,
                options: ["B පමණි", "C පමණි", "A සහ C පමණි", "B සහ C පමණි", "ඉහත සියල්ල"],
                correctAnswer: 4,
                relatedNoteId: "note-1-1-5"
            },
            {
                id: "mp1-1a-4",
                questionNumber: 4,
                content: "<p>දත්ත සැකසීමේ ජීවන චක්‍රයේ නිවැරදි අනුපිළිවෙල තෝරන්න.</p>",
                options: [
                    "දත්ත රැස් කිරීම, දත්ත වලංගු කිරීම, දත්ත සැකසීම, දත්ත ප්‍රතිදානය, දත්ත ගබඩා කිරීම",
                    "දත්ත රැස් කිරීම, දත්ත සැකසීම, දත්ත ප්‍රතිදානය, දත්ත ගබඩා කිරීම, දත්ත වලංගු කිරීම",
                    "දත්ත රැස් කිරීම, දත්ත ගබඩා කිරීම, දත්ත සැකසීම, දත්ත ප්‍රතිදානය, දත්ත වලංගු කිරීම",
                    "දත්ත වලංගු කිරීම, දත්ත රැස් කිරීම, දත්ත ගබඩා කිරීම, දත්ත සැකසීම, දත්ත ප්‍රතිදානය",
                    "දත්ත ප්‍රතිදානය, දත්ත රැස් කිරීම, දත්ත ගබඩා කිරීම, දත්ත සැකසීම, දත්ත වලංගු කිරීම"
                ],
                correctAnswer: 1,
                relatedNoteId: "note-1-1-4"
            },
            {
                id: "mp1-1a-5",
                questionNumber: 5,
                content: `<p>තොරතුරු සම්බන්ධයෙන් පහත ප්‍රකාශ සලකා බලන්න.</p>
                <p>A. පද්ධතියක් යනු පොදු අරමුණක් ඉටුකර ගැනීම සඳහා එකට ක්‍රියා කරන අන්තර් සම්බන්ධිත සංරචක ලෙස අර්ථ දැක්විය හැක.</p>
                <p>B. පද්ධතියක් ආදාන, සැකසීම සහ ප්‍රතිදාන වලින් සමන්විත වේ.</p>
                <p>C. මිනිස් ශ්වසන පද්ධතිය, පද්ධතියක් සඳහා හොඳ උදාහරණයක් ලෙස සැලකිය නොහැක.</p>
                <p>ඉහත ප්‍රකාශ වලින් නිවැරදි වන්නේ කුමක්ද?</p>`,
                options: ["A පමණි", "B පමණි", "C පමණි", "A සහ B පමණි", "A සහ C පමණි"],
                correctAnswer: 4,
                relatedNoteId: "note-7-1-0"
            },
            {
                id: "mp1-1a-6",
                questionNumber: 6,
                content: "<p>පහත දැක්වෙන ආදාන උපාංග කාණ්ඩයෙන් නිවැරදි කාණ්ඩය තෝරන්න.</p>",
                options: [
                    "මූසිකය, යතුරුපුවරුව, ජෝයිස්ටික්, මුද්‍රණ යන්ත්‍රය",
                    "මොනිටරය, ප්‍රක්ෂේපකය, මුද්‍රණ යන්ත්‍රය, ස්පීකරය",
                    "මයික්‍රොෆෝනය, ස්කෑනරය, මූසිකය, ට්‍රැක්බෝලය",
                    "ස්පර්ශ පුවරුව, ස්පීකරය, මයික්‍රොෆෝනය, මොනිටරය",
                    "මූසිකය, ප්‍රක්ෂේපකය, ස්කෑනරය, ජෝයිස්ටික්, ස්පර්ශ පුවරුව"
                ],
                correctAnswer: 3,
                relatedNoteId: "note-1-3-1"
            },
            {
                id: "mp1-1a-7",
                questionNumber: 7,
                content: "<p>පහත දැක්වෙන ප්‍රතිදාන උපාංග කාණ්ඩයෙන් නිවැරදි කාණ්ඩය තෝරන්න.</p>",
                options: [
                    "මූසිකය, යතුරුපුවරුව, ජෝයිස්ටික්, මුද්‍රණ යන්ත්‍රය",
                    "මොනිටරය, ප්‍රක්ෂේපකය, මුද්‍රණ යන්ත්‍රය, ස්පීකරය",
                    "මයික්‍රොෆෝනය, ස්කෑනරය, මූසිකය, ට්‍රැක්බෝලය",
                    "ස්පර්ශ පුවරුව, ස්පීකරය, මයික්‍රොෆෝනය, මොනිටරය",
                    "මූසිකය, ප්‍රක්ෂේපකය, ස්කෑනරය, ජෝයිස්ටික්, ස්පර්ශ පුවරුව"
                ],
                correctAnswer: 2,
                relatedNoteId: "note-1-3-1"
            },
            {
                id: "mp1-1a-8",
                questionNumber: 8,
                content: "<p>දත්ත රැස් කිරීමේ ක්‍රම සඳහා භාවිතා වන මෙවලම් අතරින් වැරදි උදාහරණය තෝරන්න.</p>",
                options: ["සංවේදක.", "තීරු කේත කියවනය.", "ප්‍රකාශ අනුලක්ෂණ කියවනය (OCR).", "චුම්බක තීරු කියවනය.", "ද්‍රව ස්ඵටික සංදර්ශක."],
                correctAnswer: 5,
                relatedNoteId: "note-1-3-1"
            },
             {
                id: "mp1-1a-9",
                questionNumber: 9,
                content: `<p>පරිගණක සකසන පිළිබඳව පහත සඳහන් දෑ සලකා බලන්න.</p>
                <p>A - වේගය</p><p>B - ධාරිතාව</p><p>C- සකසනයේ ඇති පින් ගණන</p>
                <p>පරිගණකයක් මිලදී ගැනීමේදී මේවායින් නොසැලකිය යුත්තේ කුමක්ද?</p>`,
                options: ["A පමණි", "C පමණි", "B පමණි", "B සහ C පමණි", "A සහ B පමණි"],
                correctAnswer: 2,
                relatedNoteId: "note-1-3-1"
            },
            {
                id: "mp1-1a-10",
                questionNumber: 10,
                content: `<p>පහත වාක්‍ය සලකා බලන්න,</p>
                <p>A - දෘඪාංග සහ මෘදුකාංග කළමනාකරණය සඳහා මෙහෙයුම් පද්ධතියක් අවශ්‍ය වේ.</p>
                <p>B - මෙහෙයුම් පද්ධතියක් යනු යෙදුම් මෘදුකාංගයකි.</p>
                <p>C- Fedora යනු හිමිකාර මෘදුකාංගයකි.</p>
                <p>මෙහෙයුම් පද්ධතියක් සම්බන්ධයෙන් ඉහත සඳහන් ඒවායින් නිවැරදි ලෙස සැලකිය හැක්කේ කුමක්ද?</p>`,
                options: ["A පමණි", "C පමණි", "B පමණි", "B සහ C පමණි", "A සහ B පමණි"],
                correctAnswer: 1,
                relatedNoteId: "note-1-3-2"
            },
            {
                id: "mp1-1a-11",
                questionNumber: 11,
                content: "<p>ස්ථීරාංග (firmware) සඳහා නිවැරදි උදාහරණය තෝරන්න.</p>",
                options: [
                    "මුද්‍රණ යන්ත්‍රයක උපාංග ධාවකය.",
                    "පරිගණකයක වදන් සැකසුම් මෘදුකාංගය.",
                    "පරිගණකයක මෙහෙයුම් පද්ධතිය.",
                    "පරිගණකයක BIOS.",
                    "පෙන් ඩ්‍රයිව් එකක උපාංග ධාවකය."
                ],
                correctAnswer: 4,
                relatedNoteId: "note-1-3-2"
            },
            {
                id: "mp1-1a-12",
                questionNumber: 12,
                content: `<p>පහත වාක්‍ය සලකා බලන්න,</p>
                <p>A - ස්ථීරාංග යනු දෘඪාංග උපාංගයක "කාවැද්බූ" පරිගණක වැඩසටහනකි.</p>
                <p>B - එය දෘඪාංගයේ අත්‍යවශ්‍ය කොටසකි.</p>
                <p>C- පරිගණකවල ස්ථීරාංග, ROM හි කාවැද්දී ඇත.</p>
                <p>මෙහෙයුම් පද්ධතියක් සම්බන්ධයෙන් ඉහත සඳහන් ඒවායින් නිවැරදි ලෙස සැලකිය හැක්කේ කුමක්ද?</p>`,
                options: ["A පමණි", "B සහ C පමණි", "B පමණි", "ඉහත A, B සහ C සියල්ල", "A සහ B පමණි"],
                correctAnswer: 4,
                relatedNoteId: "note-1-3-2"
            },
            {
                id: "mp1-1a-13",
                questionNumber: 13,
                content: "<p>විවෘත මූලාශ්‍ර මෘදුකාංගයක් සඳහා නිවැරදි උදාහරණය තෝරන්න.</p>",
                options: ["Microsoft Word", "Ubuntu", "Microsoft Powerpoint", "Mac OS", "Auto CAD"],
                correctAnswer: 2,
                relatedNoteId: "note-1-3-3"
            },
             {
                id: "mp1-1a-14",
                questionNumber: 14,
                content: `<p>සෑම් හිමිකාර බලපත්‍රයක් සහිත මෘදුකාංගයක් මිලදී ගත්තේය. ඔහුගේ මිතුරා වන නිමල් එම මෘදුකාංගය ලබාගෙන CD තැටියකට පිටපත් කළේය.</p>
                <p>පහත ප්‍රකාශ සලකා බලන්න:</p>
                <p>A. . Even though Sam paid for the software he had no right to let others have a copy.</p>
                <p>B. Nimal received the software through his best friend: so it’s not considered software
piracy.</p>
                <p>C. Copying down of the software by Nimal is considered illegal.</p>
                <p>ඉහත ප්‍රකාශ වලින් සත්‍ය වන්නේ කුමක්ද?</p>`,
                options: ["A පමණි", "B පමණි", "C පමණි", "A සහ C පමණි", "A සහ B පමණි"],
                correctAnswer: 4,
                relatedNoteId: "note-1-3-3"
            },
            {
                id: "mp1-1a-15",
                questionNumber: 15,
                content: "<p>බැංකුවක දෛනික ගනුදෙනු දවස අවසානයේදී සාරාංශගත කර වාර්තා සැකසීම, කුමන දත්ත සැකසුම් ක්‍රමයට අයත් වේ ද?</p>",
                options: [
                    "තථ්‍ය කාලීන සැකසුම (Real-time Processing)",
                    "මාර්ගගත සැකසුම (Online Processing)",
                    "කාණ්ඩ සැකසුම (Batch Processing)",
                    "ගනුදෙනු සැකසුම (Transaction Processing)",
                    "බහු-කාර්ය සැකසුම (Multi-tasking)"
                ],
                correctAnswer: 3,
                relatedNoteId: "note-1-5-3-1"
            },
            {
                id: "mp1-1a-16",
                questionNumber: 16,
                content: `<p>“.......................... සහ ..................... is not one of the three basic reference model on
which cloud computing was based.”</p>
                <p>A. යටිතල පහසුකම් සේවාවක් ලෙස (IaaS)</p>
                <p>B. වේදිකාවක් සේවාවක් ලෙස (PaaS)</p>
                <p>C. මෘදුකාංග සේවාවක් ලෙස (SaaS)</p>
                <p>D. තොරතුරු සේවාවක් ලෙස (IaaS)</p>
                <p>E. ආචයනය සේවාවක් ලෙස (SaaS)</p>
                <p>ඉහත ප්‍රකාශයේ හිස්තැන් පිරවීම සඳහා පහත දැක්වෙන පිළිතුරු වලින් නිවැරදි පිළිතුර තෝරන්න.</p>`,
                options: ["A සහ B", "D සහ E", "B සහ D", "C සහ E", "A සහ C"],
                correctAnswer: 2,
                relatedNoteId: "note-1-2-6"
            },
            {
                id: "mp1-1a-17",
                questionNumber: 17,
                content: "<p>පරිගණකයක් දිගු වේලාවක් භාවිතා කිරීමේදී, සෑම මිනිත්තු 20කට වරක්ම, අඩි 20ක් දුරින් ඇති වස්තුවක් දෙස තත්පර 20ක් බැලීම නිර්දේශ කරන්නේ කුමන සෞඛ්‍ය ගැටලුව වළක්වා ගැනීමටද?</p>",
                options: [
                    "පුනරාවර්තන වික්‍රියා ආබාධ (RSI)",
                    "කොන්දේ වේදනාව",
                    "ඇස් වලට ඇතිවන වෙහෙස (Eye Strain)",
                    "හිසරදය",
                    "නින්ද නොයාම"
                ],
                correctAnswer: 3,
                relatedNoteId: "note-1-2-5"
            },
            {
                id: "mp1-1a-18",
                questionNumber: 18,
                content: "<p>පුද්ගලයෙකු තමා සතු පැරණි, භාවිත කළ භාණ්ඩයක් ikman.lk වෙබ් අඩවිය හරහා වෙනත් පුද්ගලයෙකුට විකිණීම, කුමන E-commerce ව්‍යාපාර ආකෘතියට අයත් වේ ද?</p>",
                options: ["B2C", "B2B", "C2C", "G2C", "B2G"],
                correctAnswer: 3,
                relatedNoteId: "note-12-1-0"
            },
             {
                id: "mp1-1a-19",
                questionNumber: 19,
                content: `<p>ICT (තොරතුරු හා සන්නිවේදන තාක්ෂණය) වෙත ප්‍රවේශ වීමේ හැකියාව ඇති සහ නැති පුද්ගලයන් අතර පවතින පරතරය හැඳින්වීමට භාවිතා කරන යෙදුම කුමක්ද?</p>`,
                options: [
                    "සමාජ බෙදීම (Social Divide)",
                    "ආර්ථික බෙදීම (Economic Divide)",
                    "ඩිජිටල් බෙදීම (Digital Divide)",
                    "දැනුම් පරතරය (Knowledge Gap)",
                    "තාක්ෂණික පරතරය (Technology Gap)"
                ],
                correctAnswer: 3,
                relatedNoteId: "note-1-7-2"
            },
            {
                id: "mp1-1a-20",
                questionNumber: 20,
                content: `<p>හිමිකරුගේ අවසරයකින් තොරව, ප්‍රකාශන හිමිකම සහිත මෘදුකාංග, චිත්‍රපට, හෝ සංගීතය පිටපත් කිරීම සහ බෙදාහැරීම හැඳින්වෙන්නේ කුමන නමකින් ද?</p>`,
                options: [
                    "ග්‍රන්ථ චෞර්යය (Plagiarism)",
                    "තතුබෑම (Phishing)",
                    "චෞරත්වය/මුහුදු කොල්ලකෑම (Piracy)",
                    "සයිබර් හිරිහැර (Cyberbullying)",
                    "වංචනික මෘදුකාංග (Malware)"
                ],
                correctAnswer: 3,
                relatedNoteId: "note-1-7-2"
            }
        ]
      },
      partB: {
        title: "Part 2",
        instructions: "පහත ප්‍රශ්න සඳහා සුදුසු පිළිතුරු සපයන්න.",
        questions: [
          {
            id: "mp1-2-1",
            questionNumber: "1",
            content: `<p>(a) දත්ත (Data) සහ තොරතුරු (Information) යනු කුමක්දැයි උදාහරණයක් බැගින් දෙමින් පැහැදිලි කරන්න.<br/>(b) දත්ත, තොරතුරු බවට පරිවර්තනය වන ක්‍රියාවලිය සරල රූප සටහනකින් දක්වන්න.</p>`,
            totalMarks: 0,
            relatedNoteId: "note-1-1-2"
          },
          {
            id: "mp1-2-2",
            questionNumber: "2",
            content: "<p>තොරතුරුවල ස්වර්ණමය රීතිය (Golden Rule of Information) යනු කුමක්දැයි එදිනෙදා ජීවිතයෙන් උදාහරණ දෙකක් සමඟ කෙටියෙන් විස්තර කරන්න.</p>",
            totalMarks: 0,
            relatedNoteId: "note-1-1-5",
          },
          {
            id: "mp1-2-3",
            questionNumber: "3",
            content: "<p>තොරතුරු පිළිබඳ වියුක්ත ආකෘතිය නිදර්ශනය කරන්න.</p>",
            totalMarks: 0,
            relatedNoteId: "note-1-1-1",
          },
          {
            id: "mp1-2-4",
            questionNumber: "4",
            content: "<p>පරිගණකයක ප්‍රධාන සංරචක හතර නම් කරන්න.</p>",
            totalMarks: 0,
            relatedNoteId: "note-1-3-0",
          },
           {
            id: "mp1-2-5",
            questionNumber: "5",
            content: "<p>මතක වර්ගීකරණ තුන නම් කර ඒවා කෙටියෙන් පැහැදිලි කරන්න.</p>",
            totalMarks: 0,
            relatedNoteId: "note-2-4-0",
          }
        ]
      }
    }
};
